
def area(a, b):
    '''
    Вычисляет площадь прямоугольника со смежными сторонами a, b
    
        Параметры:
            a (float): длина стороны a прямоугольника в виде положительного вещественного числа
            a (float): длина стороны b прямоугольника в виде положительного вещественного числа

        Возвращаемое значение:

            area (float): площадь прямоугольника cо сторонами a, b в виде положительного вещественного числа
    '''
    return a * b


def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника со смежными сторонами a, b
    
        Параметры:
            a (float): длина стороны a прямоугольника в виде положительного вещественного числа
            b (float): длина стороны b прямоугольника в виде положительного вещественного числа

        Возвращаемое значение:

            perimeter (float): периметр прямоугольника cо сторонами a, b в виде положительного вещественного числа
    '''
    return 2 * (a + b)

