
def area(a):
    '''
    Возвращает площадь квадрата со стороной a
    
        Параметры:
            a (float): длина стороны a квадрата в виде положительного вещественного числа

        Возвращаемое значение:

            area (float): площадь квадрата со стороной a в виде положительного вещественного числа
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата со стороной a
    
        Параметры:
            a (float): длина стороны a квадрата в виде положительного вещественного числа

        Возвращаемое значение:

            perimeter (float): периметр квадрата со стороной a в виде положительного вещественного числа
    '''
    return 4 * a
